-- foldrを自分で書いてみる
foldr' :: (a -> b -> b) -> b -> [a] -> b
foldr' _ e [] = e
foldr' f e (x : xs) = f x (foldr' f e xs) -- 受け取る引数をlist構築式の形で処理している。:はリストを作る演算子である。
-- e.g. foldr' (+) 2 [1, 2, 3, 4]の場合
-- foldr' (+) 2 (1: [2, 3, 4])
-- = 1 + (foldr' 2 [2, 3, 4])
-- = 1 + 2 + (foldr' 2 [3, 4])
-- = 1 + 2 + 3 + (foldr' 2 [4])
-- = 1 + 2 + 3 + 4 + (foldr' 2 [])
-- = 1 + 2 + 3 + 4 + 2

main :: IO ()
main = do
  print $ foldr (*) 2 [1, 2, 3, 4] -- 2 * (1 * 2 * 3 * 4) = 48
  print $ foldr (+) 2 [1, 2, 3, 4] -- 2 + (1 + 2 + 3 + 4) = 12
  print $ foldr' (*) 2 [1, 2, 3, 4] -- 2 * (1 * 2 * 3 * 4) = 48
  print $ foldr' (+) 2 [1, 2, 3, 4] -- 2 + (1 + 2 + 3 + 4) = 12
